{
  "es": {
    "translation": {
      "navBar": {
        "home": "Inicio",
        "about": "Sobre mí",
        "resume": "Resumen",
        "projects": "Proyectos",
        "english": "Inglés",
        "spanish": "Español"
      },
      "welcome": {
        "title1": "¡Hola! Soy",
        "title2": "Jason Solarte",
        "title3": "Soy desarrollador",
        "professions": ["front-end.", "back-end.", "full-stack."]
      },
      "about": {
        "title": "Soy Jason Solarte, un desarrollador web trabajando como Freelancer desde Bogotá, Colombia.",
        "text1": "En los últimos 2+ años, he trabajado en varias áreas del desarrollo digital, incluyendo desarrollo front-end, back-end y diseño web. Soy un estudiante universitario con ansias de nuevos retos.",
        "text2": "En estos días, me enfoco en aprender cada vez más del mundo del desarrollo, mejorar mis conocimientos previos y dar lo mejor de mí en cada proyecto personal o profesional.",
        "cv": "Descargar CV"
      },
      "resume": {
        "sections": [
          {
            "label": "education",
            "title": "Educación",
            "items": [
              {
                "icon": "ud",
                "startDate": "Enero 2021",
                "endDate": "Actualidad",
                "title": "Ingeniería en sistemas",
                "subtitle": "Universidad Francisco José de Caldas",
                "text": "Como estudiante de pregrado de séptimo semestre, me caracterizo por mi compromiso, responsabilidad y desempeño, destacando en las materias de programación y lógica."
              },
              {
                "icon": "sena",
                "startDate": "Febrero 2018",
                "endDate": "Noviembre 2019",
                "title": "Técnico en programación de software",
                "subtitle": "SENA",
                "text": "Durante este curso senté las bases de lo que se ha convertido en una pasión genuina y un viaje de aprendizaje continuo en el desarrollo digital."
              },
              {
                "icon": "google",
                "startDate": "Diciembre 2023",
                "title": "Introducción a Git y GitHub",
                "subtitle": "Google"
              },
              {
                "icon": "coursera",
                "startDate": "Noviembre 2023",
                "title": "Contenerizar una aplicación full-stack en Docker",
                "subtitle": "Coursera Project Network"
              },
              {
                "icon": "coursera",
                "startDate": "Diciembre 2023",
                "title": "Crear un sitio web usando WordPress",
                "subtitle": "Coursera Project Network"
              },
              {
                "startDate": "Junio 2022",
                "title": "Master JS, desarrollo en JavaScript",
                "subtitle": "Noble Work Foundation"
              },
              {
                "icon": "cisco",
                "startDate": "Agosto 2022",
                "endDate": "Noviembre 2022",
                "title": "Programación esencial",
                "subtitle": "CISCO"
              }
            ]
          },
          {
            "label": "experience",
            "title": "Experiencia",
            "items": [
              {
                "startDate": "Diciembre 2021",
                "endDate": "Agosto 2022",
                "title": "Desarrollador Web Freelancer",
                "subtitle": "",
                "text": "En mi experiencia como Desarrollador Web Freelancer, mi trabajo abarcó desde el diseño inicial hasta la implementación y corrección de proyectos y páginas web. Mi enfoque multifacético me permitió participar activamente en todas las etapas del desarrollo, desde la concepción y diseño hasta el despliegue final, garantizando la entrega de productos web funcionales y estéticamente atractivos."
              },
              {
                "startDate": "Agosto 2022",
                "endDate": "Actualidad",
                "title": "Especialista en Desarrollo Front-end y Soporte Técnico",
                "subtitle": "Terios agency",
                "text": "En mi rol como Especialista en Desarrollo Front-end y Soporte Técnico en una empresa de desarrollo, me encargo de la detección y corrección de errores en proyectos de front-end. Mi labor abarca la creación de nuevos componentes, ofreciendo un respaldo esencial para abordar diversas solicitudes en una variedad de proyectos. Principalmente, utilizo ReactJS y React Native para el desarrollo front-end, aunque ocasionalmente brindo asistencia en tareas mínimas del back-end. Esta posición me sitúa en el centro de múltiples proyectos de temáticas diversas, contribuyendo a la eficiencia y éxito general del equipo de desarrollo."
              }
            ]
          },
          {
            "label": "skills",
            "title": "Habilidades",
            "items": [
              {
                "title": "Habilidades principales",
                "color": "blue",
                "items": [
                  {
                    "label": "ReactJs",
                    "icon": "react"
                  },
                  {
                    "label": "JavaScript",
                    "icon": "js"
                  },
                  {
                    "label": "HTML5",
                    "icon": "html"
                  },
                  {
                    "label": "CSS3",
                    "icon": "css"
                  },
                  {
                    "label": "Inglés B2",
                    "icon": "lang"
                  },
                  {
                    "label": "Español nativo",
                    "icon": "flag"
                  }
                ]
              },
              {
                "title": "Desarrollo",
                "color": "red",
                "items": [
                  {
                    "label": "React Native",
                    "icon": "react"
                  },
                  {
                    "label": "SQL",
                    "icon": "sql"
                  },
                  {
                    "label": "NodeJs",
                    "icon": "node"
                  },
                  {
                    "label": "Git",
                    "icon": "git"
                  },
                  {
                    "label": "GitHub",
                    "icon": "github"
                  },
                  {
                    "label": "BitBucket",
                    "icon": "bitbucket"
                  },
                  {
                    "label": "WordPress",
                    "icon": "word"
                  }
                ]
              },
              {
                "title": "Plataformas",
                "color": "green",
                "items": [
                  {
                    "label": "Jira",
                    "icon": "jira"
                  },
                  {
                    "label": "Slack",
                    "icon": "slack"
                  },
                  {
                    "label": "Figma",
                    "icon": "figma"
                  }
                ]
              }
            ]
          }
        ]
      },
      "projects": {
        "title": "Proyectos",
        "description": "Aquí tienes una selección de proyectos sobresalientes en los que he trabajado, aportando mi experiencia y dedicación.",
        "items": [
          {
            "id": "holper",
            "title": "Aplicación móvil Holper",
            "shortDescription": "Desarrollo de Holper, colaborando con un equipo interno en la integración de un servicio Prime y la implementación de nuevas vistas relacionadas.",
            "longDescription": "Holper fue un proyecto centrado en el desarrollo de una aplicación móvil para contratar servicios de limpieza. Colaboré estrechamente con el equipo interno de desarrollo, adaptando la aplicación para incluir un servicio Prime. El desafío principal fue el manejo de tecnologías, ya que la aplicación utilizaba React Native, lo que implicó aprender las diferencias entre ReactJS y React Native sobre la marcha. El equipo de desarrollo brindó apoyo en la resolución de dudas y mejoras. Otro desafío fue alinear mi trabajo con la visión a futuro del equipo, superando obstáculos al optar por soluciones más complejas y sostenibles. Mi rol se centró en agregar y modificar vistas relacionadas con el servicio Prime, consumiendo API's para su funcionalidad.",
            "date": "Agosto 2023 - Diciembre 2023",
            "technologies": ["react"],
            "challenges": [
              "Manejo de tecnologías React Native y adaptación a nuevas prácticas.",
              "Alineación con la visión a futuro del equipo y adaptación a cambios inesperados.",
              "Reinvención de soluciones ante cambios en la dirección del proyecto."
            ],
            "rol": "Me responsabilicé de agregar nuevas vistas relacionadas con el servicio Prime, modificando existentes y asegurando su funcionalidad mediante la integración de API's."
          },
          {
            "id": "yms",
            "title": "YMS - Sistema de Gestión de Yates",
            "shortDescription": "Desarrollo de un sistema de gestión, destacando la adaptación de plantillas de diseño y la implementación de lógica funcional.",
            "longDescription": "YMS fue un proyecto integral de gestión de yates. Mi principal desafío fue la gestión eficiente del tiempo, ya que me uní al proyecto en una etapa avanzada y se me exigió trabajar en plazos más cortos de lo habitual. Mi labor se centró en adaptar plantillas de diseño desde Figma, utilizando componentes definidos y corrigiendo vistas según los requisitos. Luego, implementé la lógica necesaria para hacer funcionales estas vistas mediante la integración de API's y servicios.",
            "date": "Noviembre 2023 - Enero 2024",
            "technologies": ["react", "aws", "nest", "docker"],
            "challenges": [
              "Gestión eficiente del tiempo debido a plazos ajustados.",
              "Adaptación rápida a un proyecto en una etapa media-final.",
              "Sacrificio personal para cumplir con plazos más exigentes."
            ],
            "rol": "Me encargué de adaptar plantillas de diseño, corregir vistas y aplicar la lógica funcional necesaria para hacer operativos los aspectos clave del sistema de gestión de yates."
          },
          {
            "id": "sapiolab",
            "title": "SapioLab - Sistema de Gestión Académica",
            "shortDescription": "Desarrollo de un sistema de gestión académica complejo con plataformas administrativa y de clientes.",
            "longDescription": "SapioLab fue un proyecto abarcador de gestión académica con plataformas administrativa y de clientes. El mayor desafío fue la complejidad del sistema, ya que no se planificó inicialmente, requiriendo una comprensión progresiva durante el desarrollo. Mi labor inicial consistió en la maquetación de secciones de la plataforma administrativa, creando plantillas y estructuras visuales. También participé en la resolución de errores post-pruebas QA, abordando desde cambios de formato hasta mejoras en procesos para satisfacer las expectativas del cliente.",
            "date": "Agosto 2023 - Enero 2024",
            "technologies": ["react", "aws", "nest", "docker"],
            "challenges": [
              "Enfrentar la complejidad del sistema sin una planificación inicial.",
              "Aprender sobre la marcha para comprender a fondo el funcionamiento del sistema.",
              "Adaptación a los cambios requeridos por el cliente durante la fase de QA."
            ],
            "rol": "Desempeñé un papel fundamental en la maquetación de secciones y la solución de errores post-pruebas QA, mejorando continuamente la plataforma administrativa para cumplir con las expectativas del cliente."
          }
        ]
      },
      "copied": "Elemento copiado"
    }
  },
  "en": {
    "translation": {
      "navBar": {
        "home": "Home",
        "about": "About me",
        "resume": "Resume",
        "projects": "Projects",
        "english": "English",
        "spanish": "Español"
      },
      "welcome": {
        "title1": "Hey! i am",
        "title2": "Jason Solarte",
        "title3": "I work in",
        "professions": ["front-end.", "back-end.", "full-stack."]
      },
      "about": {
        "title": "I'm Jason Solarte, web developer working as Freelancer from Bogota, Colombia.",
        "text1": "Over the past 2+ years, i've been working in various areas of digital development, including front-end development, back-end development and web design. I'm a college student eager for new challenges.",
        "text2": "These days I focus on learning more and more about the world of development, improving my previous knowledge and giving my best in each personal or professional project.",
        "cv": "Download CV"
      },
      "resume": {
        "sections": [
          {
            "label": "education",
            "title": "Education",
            "items": [
              {
                "icon": "ud",
                "startDate": "January 2021",
                "endDate": "Present",
                "title": "Systems Engineering",
                "subtitle": "Francisco Jose de Caldas University",
                "text": "As a seventh-semester undergraduate student, I am characterized by my commitment, responsibility, and performance, excelling in programming and logic subjects."
              },
              {
                "icon": "sena",
                "startDate": "February 2018",
                "endDate": "November 2019",
                "title": "Software Programming Technician",
                "subtitle": "SENA",
                "text": "During this course, I laid the foundations for what has become a genuine passion and a journey of continuous learning in digital development."
              },
              {
                "icon": "google",
                "startDate": "December 2023",
                "title": "Introduction to Git and GitHub",
                "subtitle": "Google"
              },
              {
                "icon": "coursera",
                "startDate": "November 2023",
                "title": "Containerizing a Full-Stack Application in Docker",
                "subtitle": "Coursera Project Network"
              },
              {
                "icon": "coursera",
                "startDate": "December 2023",
                "title": "Creating a Website Using WordPress",
                "subtitle": "Coursera Project Network"
              },
              {
                "startDate": "June 2022",
                "title": "Master JS, JavaScript Development",
                "subtitle": "Noble Work Foundation"
              },
              {
                "icon": "cisco",
                "startDate": "August 2022",
                "endDate": "November 2022",
                "title": "Essential Programming",
                "subtitle": "CISCO"
              }
            ]
          },
          {
            "label": "experience",
            "title": "Experience",
            "items": [
              {
                "startDate": "December 2021",
                "endDate": "August 2022",
                "title": "Freelance Web Developer",
                "subtitle": "",
                "text": "In my experience as a Freelance Web Developer, my work ranged from the initial design to the implementation and correction of projects and web pages. My multifaceted approach allowed me to actively participate in all stages of development, from conception and design to the final deployment, ensuring the delivery of functional and aesthetically appealing web products."
              },
              {
                "startDate": "August 2022",
                "endDate": "Present",
                "title": "Front-end Development Specialist and Technical Support",
                "subtitle": "Terios Agency",
                "text": "In my role as a Front-end Development Specialist and Technical Support in a development company, I am responsible for detecting and correcting errors in front-end projects. My work includes creating new components, providing essential support to address various requests in a variety of projects. Primarily, I use ReactJS and React Native for front-end development, occasionally assisting with minimal back-end tasks. This position places me at the center of multiple projects with diverse themes, contributing to the overall efficiency and success of the development team."
              }
            ]
          },
          {
            "label": "skills",
            "title": "Skills",
            "items": [
              {
                "title": "Main skills",
                "color": "blue",
                "items": [
                  {
                    "label": "ReactJs",
                    "icon": "react"
                  },
                  {
                    "label": "JavaScript",
                    "icon": "js"
                  },

                  {
                    "label": "HTML5",
                    "icon": "html"
                  },
                  {
                    "label": "CSS3",
                    "icon": "css"
                  },
                  {
                    "label": "English B2",
                    "icon": "lang"
                  },
                  {
                    "label": "Native Spanish",
                    "icon": "flag"
                  }
                ]
              },
              {
                "title": "Development skills",
                "color": "red",
                "items": [
                  {
                    "label": "React Native",
                    "icon": "react"
                  },
                  {
                    "label": "SQL",
                    "icon": "sql"
                  },
                  {
                    "label": "NodeJs",
                    "icon": "node"
                  },
                  {
                    "label": "Git",
                    "icon": "git"
                  },
                  {
                    "label": "GitHub",
                    "icon": "github"
                  },
                  {
                    "label": "BitBucket",
                    "icon": "bitbucket"
                  },
                  {
                    "label": "WordPress",
                    "icon": "word"
                  }
                ]
              },
              {
                "title": "Relevant plataforms",
                "color": "green",
                "items": [
                  {
                    "label": "Jira",
                    "icon": "jira"
                  },
                  {
                    "label": "Slack",
                    "icon": "slack"
                  },
                  {
                    "label": "Figma",
                    "icon": "figma"
                  }
                ]
              }
            ]
          }
        ]
      },
      "projects": {
        "title": "Projects",
        "description": "Here u have a selection of outstanding projects that i have worked on, contributing my experience and dedication.",
        "items": [
          {
            "id": "holper",
            "title": "Holper Mobile App",
            "shortDescription": "Development of Holper, collaborating with an internal team in the integration of a Prime service and the implementation of new related views.",
            "longDescription": "Holper was a project focused on developing a mobile app for hiring cleaning services. I worked closely with the in-house development team, adapting the app to include a Prime service. The main challenge was handling technologies, as the app used React Native, requiring me to learn on the fly the differences between ReactJS and React Native. The development team provided support in resolving doubts and making improvements. Another challenge was aligning my work with the team's future vision, overcoming obstacles by opting for more complex and sustainable solutions. My role centered on adding and modifying views related to the Prime service, consuming APIs for functionality.",
            "date": "August 2023 - December 2023",
            "technologies": ["react"],
            "challenges": [
              "Handling React Native technologies and adapting to new practices.",
              "Aligning with the team's future vision and adapting to unexpected changes.",
              "Reinventing solutions in response to changes in the project direction."
            ],
            "role": "I was responsible for adding new views related to the Prime service, modifying existing ones, and ensuring their functionality through API integration."
          },
          {
            "id": "yms",
            "title": "YMS - Yacht Management System",
            "shortDescription": "Development of a management system, emphasizing the adaptation of design templates and the implementation of functional logic.",
            "longDescription": "YMS was a comprehensive project for yacht management. My main challenge was efficient time management, as I joined the project at an advanced stage and was required to work on shorter timelines than usual. My role focused on adapting design templates from Figma, using defined components, and correcting views according to requirements. Subsequently, I implemented the necessary logic to make these views functional through the integration of APIs and services.",
            "date": "November 2023 - January 2024",
            "technologies": ["react", "aws", "nest", "docker"],
            "challenges": [
              "Efficient time management due to tight deadlines.",
              "Quick adaptation to a project in a mid-to-final stage.",
              "Personal sacrifice to meet more demanding deadlines."
            ],
            "role": "I was in charge of adapting design templates, correcting views, and implementing the necessary functional logic to make key aspects of the yacht management system operational."
          },
          {
            "id": "sapiolab",
            "title": "SapioLab - Academic Management System",
            "shortDescription": "Development of a complex academic management system with administrative and client platforms.",
            "longDescription": "SapioLab was a comprehensive academic management project with administrative and client platforms. The main challenge was the complexity of the system, as it was not initially planned, requiring a progressive understanding during development. My initial task involved the layout of sections in the administrative platform, creating templates and visual structures. I also participated in resolving post-QA testing errors, addressing everything from date format changes to process improvements to meet client expectations.",
            "date": "August 2023 - January 2024",
            "technologies": ["react", "aws", "nest", "docker"],
            "challenges": [
              "Facing the complexity of the system without initial planning.",
              "Learning on the fly to thoroughly understand the system's operation.",
              "Adapting to changes required by the client during the QA phase."
            ],
            "role": "I played a crucial role in the layout of sections and the resolution of post-QA testing errors, continually improving the administrative platform to meet client expectations."
          }
        ]
      },
      "copied": "Element copied"
    }
  }
}
